const path = require('path')
function resolve(videoName) {
  // return require(`../video/${videoName}.mp4`)
  return `http://vfx.mtime.cn/Video/2019/03/17/mp4/190317150237409904.mp4`
}
export default [
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: resolve('qilewuqiong')
      },
      {
        name: '高清',
        url: 'http://vfx.mtime.cn/Video/2019/03/17/mp4/190317150237409904.mp4'
      },
      {
        name: '超清',
        url: 'http://vfx.mtime.cn/Video/2019/03/17/mp4/190317150237409904.mp4'
      }
    ],
    cameraId: '1001',
    cameraName: '其乐无穷',
    url: resolve('qilewuqiong'),
    poster: require('../img/截图 (1).png'),
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },

  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: 'http://vfx.mtime.cn/Video/2019/03/21/mp4/190321153853126488.mp4'
      },
      {
        name: '高清',
        url: 'http://vfx.mtime.cn/Video/2019/03/21/mp4/190321153853126488.mp4'
      },
      {
        name: '超清',
        url: 'http://vfx.mtime.cn/Video/2019/03/21/mp4/190321153853126488.mp4'
      }
    ],
    cameraId: '1002',
    cameraName: '叶问4',
    url: resolve('叶问4'),
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1003',
    cameraName: '地久天长',
    url: resolve('地久天长'),
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
      ]
    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1004',
    cameraName: '复仇者联盟',
    url: resolve('复仇者联盟'),
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '天下',
    url: resolve('天下'),
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '带路人',
    url: resolve('带路人'),
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '惊奇队长',
    url: resolve('惊奇队长'),
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '扫毒',
    url: resolve('扫毒'),
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '日本动漫',
    url: resolve('日本动漫'),
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '玩具总动员',
    url: resolve('玩具总动员'),
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '紧急救援',
    url: resolve('紧急救援'),
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '花椒之味',
    url: resolve('花椒之味'),
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '莱昂纳多',
    url: resolve('莱昂纳多'),
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '阿拉丁',
    url: resolve('阿拉丁'),
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '雷霆沙赞',
    url: resolve('雷霆沙赞'),
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },


]
